Dashboard/isbank/serviceRequests/TCMB/request_uat_Tcmb_RetrieveApplicationDetail.xml

  <!-- #endpoint#http://eacrossproductservicesuat.gm.isbank.com.tr/loan-fx-tcmb-web-v1/LoanFxTcmbServiceV1#endpoint# -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://isbank.com/OpSvcs/ProdSpecificOperations/Loan/LoanFxTcmb/Service/V1">
	<soapenv:Header>
		<wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:BinarySecurityToken wsu:Id="SecurityToken-e280294f-20fa-4486-873d-eec5c6007a52" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="wsst:LTPA" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsst="http://www.ibm.com/websphere/appserver/tokentype/5.0.2">GvLhU3A5vCOX8Rga5raMxazGMC/YwuMuYlhSyyWB5Qg+7K2ZMDKtgImA/DwcPAAGpC3z3VGahP4C5L57hGAN+WHLepda8vVFsak/7wRduc02LZ2AVjrnL8DZ9HqQo6mCw2sm/oNRLiQZ+1tmfduMrtbzKcAqqfAJk2M7Hu+h+X2wr4YMBSvdVrkWXT9wz+QQPGkelfIBx+hWqECWKq0nIaHQMTD7dFbXPus7iC6dhEXxpuRL21atl2qPGo6jGfdK3ToIokK9Rp7Mnhe04U3lssRvlahfIdtWR5TgwyrKzsxaxJuG5WtLFgJEOWk4FWAdxNbGVTzYT1q1A3O0M1lBJqoBOx8jvIr2mPPnVuDpWug=</wsse:BinarySecurityToken>
		</wsse:Security>
		<p:consumerContext xsi:type="p:BranchContextType" xmlns:p="http://isbank.com/Technical/EA/Header/Schema/V1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<lang>tr</lang>
			<consumerCode>ID</consumerCode>
			<channelCode>branch</channelCode>
			<customerContext>   
				<customer>
					<customerNumber>601</customerNumber>
					<citizenId>13171212356</citizenId>
					<name>SEMİHA</name>
					<surname>GÜÇASY</surname>
					<taxId>4120127573</taxId>
				</customer>
			</customerContext>
			<ipAddress>10.20.12.182</ipAddress>
			<workstationName>1095X002</workstationName>
			<organizationUnitCode>1095</organizationUnitCode>
		</p:consumerContext>
	</soapenv:Header>
  <soapenv:Body>
      <v1:RetrieveApplicationDetailByNo>
         <v1:applicationNo>064201900000011</v1:applicationNo>
      </v1:RetrieveApplicationDetailByNo>
   </soapenv:Body>
</soapenv:Envelope>